// 节气数据
// 自动生成，请勿手动修改

export const JIEQI_NAMES = [
  "春分",
  "清明",
  "谷雨",
  "立夏",
  "小满",
  "芒種",
  "夏至",
  "小暑",
  "大暑",
  "立秋",
  "处暑",
  "白露",
  "秋分",
  "寒露",
  "霜降",
  "立冬",
  "小雪",
  "大雪",
  "冬至",
  "小寒",
  "大寒",
  "立春",
  "雨水",
  "惊蟄"
] as const;

export const WANGZHUAI = [
  "旺",
  "相",
  "胎",
  "沒",
  "死",
  "囚",
  "休",
  "废"
] as const;

export const WANGZHUAI_GUA = [
  "震",
  "巽",
  "离",
  "坤",
  "兑",
  "乾",
  "坎",
  "艮"
] as const;

export const JIEQI_GROUPS = {
  "春分": [
    "春分",
    "清明",
    "谷雨"
  ],
  "立夏": [
    "立夏",
    "小满",
    "芒種"
  ],
  "夏至": [
    "夏至",
    "小暑",
    "大暑"
  ],
  "立秋": [
    "立秋",
    "处暑",
    "白露"
  ],
  "秋分": [
    "秋分",
    "寒露",
    "霜降"
  ],
  "立冬": [
    "立冬",
    "小雪",
    "大雪"
  ],
  "冬至": [
    "冬至",
    "小寒",
    "大寒"
  ],
  "立春": [
    "立春",
    "雨水",
    "惊蟄"
  ]
} as const;
